#+TITLE: Emacs Light 
#+STARTUP: overview indent
#+TODO: TODO | DONE 
#+PROPERTY: header-args :tangle ~/.emacs.d/init.el

Keybindings:
- Leader: SPACE
- C-t   : alternativ im emacs-mode
- C-q   : transient Menüs
- ^x ^f : exit ido

** org-babel
#+begin_src emacs-lisp
  (org-babel-do-load-languages 'org-babel-load-languages
  			       (append org-babel-load-languages
  				       '((shell     . t)
  					 (js        . t)
  					 (python     . t)
  					 (awk       . t))))

  ;; damit :session funktioniert ...
  (setq python-shell-completion-native-enable nil)

  (setq org-babel-python-command "python3")
#+end_src

#+begin_src python :tangle no :results output
  import os
  from datetime import datetime
  import platform
  print("Kernel " + platform.python_version() + " in " + os.getcwd() + " (" + datetime.now().strftime("%d/%m/%Y %H:%M:%S") + ")")
#+end_src

#+RESULTS:
: Kernel 3.13.5 in /home/uwek (06/01/2026 22:37:13)

#+begin_src shell :tangle no
echo "Moin!"
#+end_src

